// Pattern data derived from jsAvroPhonetic by OmicronLab contributors.
// Generated from ../../../avroregexlib.js; see LICENSE for the MPL-2.0 terms.
use super::patterns::{Condition, Pattern, Position, Rule, Scope};

pub(crate) const IGNORE: &str = r#"|()[]{}^$*+?.~!@#%&-_='";<>/\,:`"#;

pub(crate) static PATTERNS: &[Pattern] = &[
    Pattern {
        find: r"aa",
        replace: r"(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‍‌]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‍‌]?(্য)?া)|(য়া)))?))",
        rules: &[
        ],
    },
    Pattern {
        find: r"au",
        replace: r"(ঔ|ৌ(([অএ]্যা?)|[আএ]|([‍‌]?(্য)?া)|(য়া))([উঊুূ]|(য়[ুূ])))",
        rules: &[
        ],
    },
    Pattern {
        find: r"az",
        replace: r"((([অএ]্যা?)|[আএ]|([‍‌]?(্য)?া)|(য়া))((জ|য|(জ়)|([‍‌]?্য)))?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"ai",
        replace: r"(ঐ|ৈ|(([অএ]্যা?)|[আএ]|([‍‌]?(্য)?া)|(য়া))([ইঈিী]|(য়[িী])))",
        rules: &[
        ],
    },
    Pattern {
        find: r"a",
        replace: r"(([অএ]্যা?)|[অআএ]|([‍‌]?(্য)?া)|(য়া))",
        rules: &[
        ],
    },
    Pattern {
        find: r"bdh",
        replace: r"((ব(্?)(ধ|ঢ|([দড](্?)(হ|ঃ|(হ্‌?)))))|((ব(্?)[দড])(্?)(হ|ঃ|(হ্‌?)))|(ব(্?)[দড](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"bhl",
        replace: r"(((ভ|(ব(্?)(হ|ঃ|(হ্‌?))))(্?)ল)|(ব(্?)((হ|ঃ|(হ্‌?))(্?)ল))|(ব(্?)(হ|ঃ|(হ্‌?))(্?)ল))",
        rules: &[
        ],
    },
    Pattern {
        find: r"bh",
        replace: r"(ভ|(ব(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"bb",
        replace: r"(ব(্?)ব?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"bd",
        replace: r"(ব(্?)[দড])",
        rules: &[
        ],
    },
    Pattern {
        find: r"bv",
        replace: r"(ব?(্?)ভ)",
        rules: &[
        ],
    },
    Pattern {
        find: r"b",
        replace: r"ব",
        rules: &[
        ],
    },
    Pattern {
        find: r"chchh",
        replace: r"((চ্ছ)|((চ|ছ|([চছ](্?)(হ|ঃ|(হ্‌?))))(্?)(((চ|ছ|([চছ](্?)(হ|ঃ|(হ্‌?))))(্?)((হ|ঃ|(হ্‌?)))?)|([চছ](্?)((হ|ঃ|(হ্‌?))(্?)(হ|ঃ|(হ্‌?))))|([চছ](্?)(হ|ঃ|(হ্‌?))(্?)(হ|ঃ|(হ্‌?)))))|((চ|ছ|([চছ](্?)(হ|ঃ|(হ্‌?))))(্?)(চ|ছ|([চছ](্?)(হ|ঃ|(হ্‌?))))(্?)(হ|ঃ|(হ্‌?)))|([চছ](্?)(হ|ঃ|(হ্‌?))(্?)[চছ](্?)(হ|ঃ|(হ্‌?))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"cch",
        replace: r"(([চছ](্?)(চ|ছ|([চছ](্?)(হ|ঃ|(হ্‌?)))))|([চছ](্?)[চছ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"chh",
        replace: r"(((চ|ছ|([চছ](্?)(হ|ঃ|(হ্‌?))))(্?)((হ|ঃ|(হ্‌?)))?)|([চছ](্?)((হ|ঃ|(হ্‌?))(্?)(হ|ঃ|(হ্‌?))))|([চছ](্?)(হ|ঃ|(হ্‌?))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"cng",
        replace: r"((চ্ঞ)|([চছ](্?)(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ)))))|([চছ](্?)[নণঁঙঞং](্?)(গ|(জ্ঞ)))|(([চছ](্?)[নণঁঙঞং])(্?)(গ|(জ্ঞ))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ch",
        replace: r"(চ|ছ|([চছ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ck",
        replace: r"(ক|([চছ](্?)ক))",
        rules: &[
        ],
    },
    Pattern {
        find: r"cc",
        replace: r"([চছ](্?)[চছ]?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"cn",
        replace: r"([চছ](্?)[নণঁঙঞং])",
        rules: &[
        ],
    },
    Pattern {
        find: r"c",
        replace: r"[চছ]",
        rules: &[
        ],
    },
    Pattern {
        find: r"dhm",
        replace: r"((([দড](্?)(গ|(জ্ঞ)))(্?)ম)|([দড](্?)((হ|ঃ|(হ্‌?))(্?)ম))|([দড](্?)(হ|ঃ|(হ্‌?))(্?)ম))",
        rules: &[
        ],
    },
    Pattern {
        find: r"dhn",
        replace: r"(((ধ|ঢ|([দড](্?)(হ|ঃ|(হ্‌?))))(্?)[নণঁঙঞং])|([দড](্?)((হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))|([দড](্?)(হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"dbh",
        replace: r"(([দড](্?)(ভ|(ব(্?)(হ|ঃ|(হ্‌?)))))|(([দড](্?)ব)(্?)(হ|ঃ|(হ্‌?)))|([দড](্?)ব(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ddh",
        replace: r"(([দড]?(্?)([দড](্?)(গ|(জ্ঞ))))|(([দড](্?)[দড]?)(্?)(হ|ঃ|(হ্‌?)))|([দড](্?)[দড](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"dgh",
        replace: r"(([দড](্?)(ঘ|((গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?)))))|(([দড](্?)(গ|(জ্ঞ)))(্?)(হ|ঃ|(হ্‌?)))|([দড](্?)(গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"db",
        replace: r"([দড](্?)ব)",
        rules: &[
        ],
    },
    Pattern {
        find: r"dd",
        replace: r"([দড](্?)[দড]?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"dg",
        replace: r"([দড](্?)(গ|(জ্ঞ)))",
        rules: &[
        ],
    },
    Pattern {
        find: r"dh",
        replace: r"(ধ|ঢ|([দড](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"d",
        replace: r"[দড]",
        rules: &[
        ],
    },
    Pattern {
        find: r"ey",
        replace: r"(এ|ই|ে|(েই)|(এই)|ঈ|ী|(((এ্যা?)|[এে]|([‍‌]?(্য)া)|(য়ে))(য়|(ইয়)|([‍‌]?্য))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ee",
        replace: r"(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‍‌]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‍‌]?(্য)া)|(য়ে))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"e",
        replace: r"((এ্যা?)|[এে]|([‍‌]?(্য)া)|(য়ে))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ff",
        replace: r"(ফ(্?)ফ?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"f",
        replace: r"ফ",
        rules: &[
        ],
    },
    Pattern {
        find: r"ggh",
        replace: r"((((জ্ঞ)|((গ|(জ্ঞ))(্?)((গ|(জ্ঞ)))?))(্?)(হ|ঃ|(হ্‌?)))|((গ|(জ্ঞ))(্?)(ঘ|((গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))(্?)(গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"gdh",
        replace: r"(((গ|(জ্ঞ))(্?)(ধ|ঢ|([দড](্?)(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))(্?)[দড](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ghn",
        replace: r"(((ঘ|((গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?))))(্?)[নণঁঙঞং])|((গ|(জ্ঞ))(্?)((হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))|((গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"gh",
        replace: r"(ঘ|((গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"gg",
        replace: r"((জ্ঞ)|((গ|(জ্ঞ))(্?)((গ|(জ্ঞ)))?))",
        rules: &[
        ],
    },
    Pattern {
        find: r"g",
        replace: r"(গ|(জ্ঞ))",
        rules: &[
        ],
    },
    Pattern {
        find: r"hl",
        replace: r"((হ|ঃ|(হ্‌?))(্?)ল)",
        rules: &[
        ],
    },
    Pattern {
        find: r"hh",
        replace: r"((হ|ঃ|(হ্‌?))(্?)(হ|ঃ|(হ্‌?)))",
        rules: &[
        ],
    },
    Pattern {
        find: r"hm",
        replace: r"((হ|ঃ|(হ্‌?))(্?)ম)",
        rules: &[
        ],
    },
    Pattern {
        find: r"hn",
        replace: r"((হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং])",
        rules: &[
        ],
    },
    Pattern {
        find: r"h",
        replace: r"(হ|ঃ|(হ্‌?))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ia",
        replace: r"((ঞা)|(([ইঈিী]|(য়[িী]))(([অএ]্যা?)|[আএ]|([‍‌]?(্য)?া)|(য়া))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"i",
        replace: r"([ইঈিী]|(য়[িী]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"jng",
        replace: r"((জ্ঞ)|(([জয]|(জ়))(্?)(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ)))))|(([জয]|(জ়))(্?)[নণঁঙঞং](্?)(গ|(জ্ঞ))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"jjh",
        replace: r"(((([জয]|(জ়)))?(্?)(ঝ|(([জয]|(জ়))(্?)(হ|ঃ|(হ্‌?)))))|(হ্য)|(((হ্য)|(([জয]|(জ়))(্?)(([জয]|(জ়)))?))(্?)(হ|ঃ|(হ্‌?)))|(([জয]|(জ়))(্?)([জয]|(জ়))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"jj",
        replace: r"((হ্য)|(([জয]|(জ়))(্?)(([জয]|(জ়)))?))",
        rules: &[
        ],
    },
    Pattern {
        find: r"jh",
        replace: r"(ঝ|(([জয]|(জ়))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"j",
        replace: r"([জয]|(জ়))",
        rules: &[
        ],
    },
    Pattern {
        find: r"kshm",
        replace: r"((((ক(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))|((ক(্?)[সশষ])(্?)(হ|ঃ|(হ্‌?)))|(ক(্?)[সশষ](্?)(হ|ঃ|(হ্‌?))))(্?)ম)|(ক(্?)(((স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?))))(্?)ম)|([সশষ](্?)((হ|ঃ|(হ্‌?))(্?)ম))|([সশষ](্?)(হ|ঃ|(হ্‌?))(্?)ম)))|((ক(্?)[সশষ])(্?)((হ|ঃ|(হ্‌?))(্?)ম))|(ক(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?))))(্?)ম)|(ক(্?)[সশষ](্?)(হ|ঃ|(হ্‌?))(্?)ম))",
        rules: &[
        ],
    },
    Pattern {
        find: r"kkhm",
        replace: r"((((ক্ষ)|((ক(্?)ক?)(্?)(হ|ঃ|(হ্‌?)))|(ক?(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?)))))|(ক(্?)ক(্?)(হ|ঃ|(হ্‌?))))(্?)ম)|((ক(্?)ক?)(্?)((হ|ঃ|(হ্‌?))(্?)ম))|(ক(্?)ক(্?)(হ|ঃ|(হ্‌?))(্?)ম)|(ক(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?))))(্?)ম))",
        rules: &[
        ],
    },
    Pattern {
        find: r"kshn",
        replace: r"((((ক(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))|((ক(্?)[সশষ])(্?)(হ|ঃ|(হ্‌?)))|(ক(্?)[সশষ](্?)(হ|ঃ|(হ্‌?))))(্?)[নণঁঙঞং])|(ক(্?)(((স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?))))(্?)[নণঁঙঞং])|([সশষ](্?)((হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))|([সশষ](্?)(হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং])))|((ক(্?)[সশষ])(্?)((হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))|(ক(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?))))(্?)[নণঁঙঞং])|(ক(্?)[সশষ](্?)(হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"kkhn",
        replace: r"((((ক্ষ)|((ক(্?)ক?)(্?)(হ|ঃ|(হ্‌?)))|(ক?(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?)))))|(ক(্?)ক(্?)(হ|ঃ|(হ্‌?))))(্?)[নণঁঙঞং])|((ক(্?)ক?)(্?)((হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))|(ক(্?)ক(্?)(হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং])|(ক(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?))))(্?)[নণঁঙঞং]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ksh",
        replace: r"((ক(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))|((ক(্?)[সশষ])(্?)(হ|ঃ|(হ্‌?)))|(ক(্?)[সশষ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"kkh",
        replace: r"((ক্ষ)|((ক(্?)ক?)(্?)(হ|ঃ|(হ্‌?)))|(ক?(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?)))))|(ক(্?)ক(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"kxm",
        replace: r"((((ক্ষ)|(ক(্?)((ক্স)|(এক্স)|ষ)))(্?)ম)|(ক(্?)(((ক্স)|(এক্স)|ষ)(্?)ম))|(ক(্?)((ক্স)|(এক্স)|ষ)(্?)ম))",
        rules: &[
        ],
    },
    Pattern {
        find: r"kxn",
        replace: r"((((ক্ষ)|(ক(্?)((ক্স)|(এক্স)|ষ)))(্?)[নণঁঙঞং])|(ক(্?)(((ক্স)|(এক্স)|ষ)(্?)[নণঁঙঞং]))|(ক(্?)((ক্স)|(এক্স)|ষ)(্?)[নণঁঙঞং]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"kh",
        replace: r"(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"kk",
        replace: r"(ক(্?)ক?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"ks",
        replace: r"(ক(্?)[সশষ])",
        rules: &[
        ],
    },
    Pattern {
        find: r"kx",
        replace: r"((ক্ষ)|(ক(্?)((ক্স)|(এক্স)|ষ)))",
        rules: &[
        ],
    },
    Pattern {
        find: r"k",
        replace: r"ক",
        rules: &[
        ],
    },
    Pattern {
        find: r"lkh",
        replace: r"((ল(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?)))))|((ল(্?)ক)(্?)(হ|ঃ|(হ্‌?)))|(ল(্?)ক(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"lgh",
        replace: r"((ল(্?)(ঘ|((গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?)))))|((ল(্?)(গ|(জ্ঞ)))(্?)(হ|ঃ|(হ্‌?)))|(ল(্?)(গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"lph",
        replace: r"((ল(্?)(ফ|(প(্?)(হ|ঃ|(হ্‌?)))))|((ল(্?)প)(্?)(হ|ঃ|(হ্‌?)))|(ল(্?)প(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ldh",
        replace: r"((ল(্?)(ধ|ঢ|([দড](্?)(হ|ঃ|(হ্‌?)))))|((ল(্?)[দড])(্?)(হ|ঃ|(হ্‌?)))|(ল(্?)[দড](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"lbh",
        replace: r"((ল(্?)(ভ|(ব(্?)(হ|ঃ|(হ্‌?)))))|((ল(্?)ব)(্?)(হ|ঃ|(হ্‌?)))|(ল(্?)ব(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ll",
        replace: r"((হ্ল)|(ল?(্?)ল)|(ল(্?)ল))",
        rules: &[
        ],
    },
    Pattern {
        find: r"lk",
        replace: r"(ল(্?)ক)",
        rules: &[
        ],
    },
    Pattern {
        find: r"lg",
        replace: r"(ল(্?)(গ|(জ্ঞ)))",
        rules: &[
        ],
    },
    Pattern {
        find: r"lp",
        replace: r"(ল(্?)প)",
        rules: &[
        ],
    },
    Pattern {
        find: r"ld",
        replace: r"(ল(্?)[দড])",
        rules: &[
        ],
    },
    Pattern {
        find: r"lb",
        replace: r"(ল(্?)ব)",
        rules: &[
        ],
    },
    Pattern {
        find: r"l",
        replace: r"ল",
        rules: &[
        ],
    },
    Pattern {
        find: r"mbh",
        replace: r"((ম(্?)(ভ|(ব(্?)(হ|ঃ|(হ্‌?)))))|((ম(্?)ব)(্?)(হ|ঃ|(হ্‌?)))|(ম(্?)ব(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"mph",
        replace: r"((ম(্?)(ফ|(প(্?)(হ|ঃ|(হ্‌?)))))|((ম(্?)প)(্?)(হ|ঃ|(হ্‌?)))|(ম(্?)প(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"mth",
        replace: r"((ম(্?)(থ|ঠ|([তটৎ](্?)(হ|ঃ|(হ্‌?)))))|((ম(্?)[তটৎ])(্?)(হ|ঃ|(হ্‌?)))|(ম(্?)[তটৎ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"mm",
        replace: r"((হ্ম)|(ম(্?)ম?))",
        rules: &[
        ],
    },
    Pattern {
        find: r"mb",
        replace: r"(ম(্?)ব)",
        rules: &[
        ],
    },
    Pattern {
        find: r"mp",
        replace: r"(ম(্?)প)",
        rules: &[
        ],
    },
    Pattern {
        find: r"mt",
        replace: r"(ম(্?)[তটৎ])",
        rules: &[
        ],
    },
    Pattern {
        find: r"m",
        replace: r"ম",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngksh",
        replace: r"(((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)ক)|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ক))(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)ক(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)((ক(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))|((ক(্?)[সশষ])(্?)(হ|ঃ|(হ্‌?)))|(ক(্?)[সশষ](্?)(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)(ক(্?)[সশষ])(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ক(্?)[সশষ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngkkh",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)((ক্ষ)|((ক(্?)ক?)(্?)(হ|ঃ|(হ্‌?)))|(ক?(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?)))))|(ক(্?)ক(্?)(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)ক)|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ক))(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)ক(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)(ক(্?)ক?)(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ক(্?)ক(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngch",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)(চ|ছ|([চছ](্?)(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)[চছ])|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)[চছ]))(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)[চছ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nggh",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)(ঘ|((গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং](্?)((জ্ঞ)|((গ|(জ্ঞ))(্?)((গ|(জ্ঞ)))?))(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)((((জ্ঞ)|((গ|(জ্ঞ))(্?)((গ|(জ্ঞ)))?))(্?)(হ|ঃ|(হ্‌?)))|((গ|(জ্ঞ))(্?)(ঘ|((গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))(্?)(গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)(গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?)))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)(গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?)))|(((ঙ্গ)|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)(গ|(জ্ঞ)))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)(গ|(জ্ঞ))))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngkx",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)((ক্ষ)|(ক(্?)((ক্স)|(এক্স)|ষ))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)ক)|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ক))(্?)((ক্স)|(এক্স)|ষ))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)((ক্ষ)|(ক(্?)((ক্স)|(এক্স)|ষ))))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ক(্?)((ক্স)|(এক্স)|ষ)))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngjh",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)(ঝ|(([জয]|(জ়))(্?)(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)([জয]|(জ়)))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)([জয]|(জ়))))(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)([জয]|(জ়))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngkh",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)ক(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ক(্?)(হ|ঃ|(হ্‌?)))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)ক)|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ক))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nsh",
        replace: r"(([নণঁঙঞং](্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং](্?)[সশষ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ndh",
        replace: r"(([নণঁঙঞং](্?)(ধ|ঢ|([দড](্?)(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং](্?)[দড])(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)[দড](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nkh",
        replace: r"(([নণঁঙঞং](্?)(খ|(ক্ষ)|(ক(্?)(হ|ঃ|(হ্‌?)))))|(((ঙ্ক)|([নণঁঙঞং](্?)ক))(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)ক(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nth",
        replace: r"(([নণঁঙঞং](্?)(থ|ঠ|([তটৎ](্?)(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং](্?)[তটৎ])(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)[তটৎ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngj",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)([জয]|(জ়)))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)([জয]|(জ়))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngm",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)ম)|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ম))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngg",
        replace: r"((ঙ্গ)|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)(গ|(জ্ঞ)))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)(গ|(জ্ঞ))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngx",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)((ক্স)|(এক্স)|ষ))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)((ক্স)|(এক্স)|ষ)))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngk",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)ক)|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)ক))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngh",
        replace: r"((ঙ্ঘ)|([নণঁঙঞং](্?)(ঘ|((গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nch",
        replace: r"(([নণঁঙঞং](্?)(চ|ছ|([চছ](্?)(হ|ঃ|(হ্‌?)))))|(((ঞ্চ)|([নণঁঙঞং](্?)[চছ]))(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)[চছ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"njh",
        replace: r"(([নণঁঙঞং](্?)(ঝ|(([জয]|(জ়))(্?)(হ|ঃ|(হ্‌?)))))|(((ঞ্জ)|([নণঁঙঞং](্?)([জয]|(জ়))))(্?)(হ|ঃ|(হ্‌?)))|([নণঁঙঞং](্?)([জয]|(জ়))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ngc",
        replace: r"(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))(্?)[চছ])|([নণঁঙঞং](্?)(গ|(জ্ঞ))(্?)[চছ]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nc",
        replace: r"((ঞ্চ)|([নণঁঙঞং](্?)[চছ]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nn",
        replace: r"((হ্ণ)|(হ্ন)|([নণঁঙঞং](্?)[নণঁঙঞং]?))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ng",
        replace: r"(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং](্?)(গ|(জ্ঞ))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nk",
        replace: r"((ঙ্ক)|([নণঁঙঞং](্?)ক))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nj",
        replace: r"((ঞ্জ)|([নণঁঙঞং](্?)([জয]|(জ়))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"nd",
        replace: r"([নণঁঙঞং](্?)[দড])",
        rules: &[
        ],
    },
    Pattern {
        find: r"nt",
        replace: r"([নণঁঙঞং](্?)[তটৎ])",
        rules: &[
        ],
    },
    Pattern {
        find: r"n",
        replace: r"[নণঁঙঞং]",
        rules: &[
        ],
    },
    Pattern {
        find: r"oo",
        replace: r"((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))",
        rules: &[
        ],
    },
    Pattern {
        find: r"oi",
        replace: r"(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ou",
        replace: r"(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"o",
        replace: r"([ওোঅ]|(অ্য)|(য়ো?))?",
        rules: &[
            Rule {
                conditions: &[
                    Condition { position: Position::Prefix, scope: Scope::Punctuation, value: r"", negative: true },
                ],
                replace: r"([ওোঅ]|(অ্য)|(য়ো?))",
            },
        ],
    },
    Pattern {
        find: r"phl",
        replace: r"(((ফ|(প(্?)(হ|ঃ|(হ্‌?))))(্?)ল)|(প(্?)((হ|ঃ|(হ্‌?))(্?)ল))|(প(্?)(হ|ঃ|(হ্‌?))(্?)ল))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ph",
        replace: r"(ফ|(প(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"pp",
        replace: r"(প(্?)প?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"p",
        replace: r"প",
        rules: &[
        ],
    },
    Pattern {
        find: r"qq",
        replace: r"(ক(্?)ক?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"q",
        replace: r"ক",
        rules: &[
        ],
    },
    Pattern {
        find: r"rri",
        replace: r"(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ri",
        replace: r"(ঋ|ৃ|(হৃ)|(([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"rh",
        replace: r"((([রড়ঢ়]|(হ্র)))|(([রড়ঢ়]|(হ্র))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"r",
        replace: r"([রড়ঢ়]|(হ্র))",
        rules: &[
        ],
    },
    Pattern {
        find: r"shsh",
        replace: r"((((স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))?(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))|([সশষ](্?)(হ|ঃ|(হ্‌?))(্?)[সশষ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ssh",
        replace: r"(([সশষ]?(্?)(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?)))))|([সশষ](্?)[সশষ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"shm",
        replace: r"(((স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?))))(্?)ম)|([সশষ](্?)((হ|ঃ|(হ্‌?))(্?)ম))|([সশষ](্?)(হ|ঃ|(হ্‌?))(্?)ম))",
        rules: &[
        ],
    },
    Pattern {
        find: r"shn",
        replace: r"(((স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?))))(্?)[নণঁঙঞং])|([সশষ](্?)((হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))|([সশষ](্?)(হ|ঃ|(হ্‌?))(্?)[নণঁঙঞং]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"ss",
        replace: r"([সশষ](্?)[সশষ]?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"sh",
        replace: r"(স|শ|ষ|([সশষ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"s",
        replace: r"[সশষ]",
        rules: &[
        ],
    },
    Pattern {
        find: r"thth",
        replace: r"((ত্থ)|(((থ|ঠ|([তটৎ](্?)(হ|ঃ|(হ্‌?)))))?(্?)(থ|ঠ|([তটৎ](্?)(হ|ঃ|(হ্‌?)))))|([তটৎ](্?)(হ|ঃ|(হ্‌?))(্?)[তটৎ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"tth",
        replace: r"(([তটৎ]?(্?)(থ|ঠ|([তটৎ](্?)(হ|ঃ|(হ্‌?)))))|(([তটৎ](্?)[তটৎ]?)(্?)(হ|ঃ|(হ্‌?)))|([তটৎ](্?)[তটৎ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"t``",
        replace: r"ৎ",
        rules: &[
        ],
    },
    Pattern {
        find: r"tth",
        replace: r"(([তটৎ]?(্?)(থ|ঠ|([তটৎ](্?)(হ|ঃ|(হ্‌?)))))|(([তটৎ](্?)[তটৎ]?)(্?)(হ|ঃ|(হ্‌?)))|([তটৎ](্?)[তটৎ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"tt",
        replace: r"([তটৎ](্?)[তটৎ]?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"th",
        replace: r"(থ|ঠ|([তটৎ](্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"t",
        replace: r"[তটৎ]",
        rules: &[
        ],
    },
    Pattern {
        find: r"uu",
        replace: r"(ঊ|ূ|(([উঊুূ]|(য়[ুূ]))(([উঊুূ]|(য়[ুূ])))?))",
        rules: &[
        ],
    },
    Pattern {
        find: r"u",
        replace: r"([উঊুূ]|(য়[ুূ]))",
        rules: &[
        ],
    },
    Pattern {
        find: r"vv",
        replace: r"(ভ(্?)ভ?)",
        rules: &[
        ],
    },
    Pattern {
        find: r"v",
        replace: r"ভ",
        rules: &[
        ],
    },
    Pattern {
        find: r"w",
        replace: r"(ও|(ওয়)|(্ব))",
        rules: &[
        ],
    },
    Pattern {
        find: r"xm",
        replace: r"(((ক্স)|(এক্স)|ষ)(্?)ম)",
        rules: &[
        ],
    },
    Pattern {
        find: r"xn",
        replace: r"(((ক্স)|(এক্স)|ষ)(্?)[নণঁঙঞং])",
        rules: &[
        ],
    },
    Pattern {
        find: r"x",
        replace: r"((ক্স)|(এক্স)|ষ)",
        rules: &[
        ],
    },
    Pattern {
        find: r"y",
        replace: r"(য়|(ইয়)|([‍‌]?্য))",
        rules: &[
        ],
    },
    Pattern {
        find: r"zzh",
        replace: r"((হ্য)|((জ|য|(জ়)|([‍‌]?্য))(্?)(ঝ|(([জয]|(জ়))(্?)(হ|ঃ|(হ্‌?)))))|(((হ্য)|((জ|য|(জ়)|([‍‌]?্য))(্?)((জ|য|(জ়)|([‍‌]?্য)))?))(্?)(হ|ঃ|(হ্‌?)))|((জ|য|(জ়)|([‍‌]?্য))(্?)(জ|য|(জ়)|([‍‌]?্য))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"zh",
        replace: r"(ঝ|(([জয]|(জ়))(্?)(হ|ঃ|(হ্‌?))))",
        rules: &[
        ],
    },
    Pattern {
        find: r"zz",
        replace: r"((হ্য)|((জ|য|(জ়)|([‍‌]?্য))(্?)((জ|য|(জ়)|([‍‌]?্য)))?))",
        rules: &[
        ],
    },
    Pattern {
        find: r"z",
        replace: r"(জ|য|(জ়)|([‍‌]?্য))",
        rules: &[
        ],
    },
    Pattern {
        find: r"0",
        replace: r"(০|(0)|(শূন্য))",
        rules: &[
        ],
    },
    Pattern {
        find: r"1",
        replace: r"(১|(1)|(এক))",
        rules: &[
        ],
    },
    Pattern {
        find: r"2",
        replace: r"(২|(2)|(দুই))",
        rules: &[
        ],
    },
    Pattern {
        find: r"3",
        replace: r"(৩|(3)|(তিন))",
        rules: &[
        ],
    },
    Pattern {
        find: r"4",
        replace: r"(৪|(4)|(চার))",
        rules: &[
        ],
    },
    Pattern {
        find: r"5",
        replace: r"(৫|(5)|(পাঁচ))",
        rules: &[
        ],
    },
    Pattern {
        find: r"6",
        replace: r"((6)|৬|(ছয়))",
        rules: &[
        ],
    },
    Pattern {
        find: r"7",
        replace: r"(৭|(7)|(সাত))",
        rules: &[
        ],
    },
    Pattern {
        find: r"8",
        replace: r"(৮|(8)|(আট))",
        rules: &[
        ],
    },
    Pattern {
        find: r"9",
        replace: r"(৯|(9)|(নয়))",
        rules: &[
        ],
    },
    Pattern {
        find: r"`",
        replace: r"",
        rules: &[
        ],
    },
];
